a1 = int(input("Введіть початкову годину: "))
a2 = int(input("Введіть початкову хвилину: "))
a3 = int(input("Введіть початкову секунду: "))
b1 = int(input("Введіть кінцеву годину: "))
b2 = int(input("Введіть кінцеву хвилину: "))
b3 = int(input("Введіть кінцеву секунду: "))

a4 = a1*3600+a2*60+a3
b4 = b1*3600+b2*60+b3

ab=a4 - b4
print("різниця між введеними моментами",ab,"секунд")
ab1=ab//3600
ab2=ab//60 - ab1*60
ab3=ab - ab1*3600 - ab2*60

print("різниця між введеними моментами",ab1,"годин",",",ab2,"хвилин",",",ab3,"секунд")